FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_Serial.c
/*-------------------------------------------------------------------------*
 * File:  RX62N_Serial.c
 *-------------------------------------------------------------------------*
 * Description:
 *      Renesas RX62N Serial Communications Interface (SCIa)
 * Implementation:
 *      Six serial interfaces are provided here.
 *      Buffers/Queues are not stored here but handled
 *      by the layer above.  Only callback functions from within
 *      the IRQ are provided.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZ License.pdf or visit http://goo.gl/UDtTCR for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(r) to your own hardware!   |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <uEZ.h>
#include <HAL/HAL.h>
#include <HAL/Serial.h>
#include <HAL/Interrupt.h>
#include <uEZProcessor.h>
#include "RX62N_UtilityFuncs.h"
#include "RX62N_Serial.h"

// TBD:  not here!
#include <uEZRTOS.h>

#if (COMPILER_TYPE==RenesasRX)
typedef volatile struct st_sci __evenaccess T_RX62N_SCI;
#endif

/*---------------------------------------------------------------------------*
 * Constants and Macros:
 *---------------------------------------------------------------------------*/
#define BAUD_DIVIDER(b)         (((PCLK_FREQUENCY/1)/((b)*32))-1)

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
// Entry of SCI_ port settings
typedef struct {
    TUInt32 iInterruptChannel_RX;
    TUInt32 iInterruptChannel_TX;
    T_irqPriority iPriority;
    T_RX62N_SCI *iSCIRegs;
    TISRFPtr iISR_RX;
    TISRFPtr iISR_TX;
    TUInt16 iMSTPBit;
    TUInt8 iPFFSCIBit;
} T_Serial_RX62N_Info;

typedef struct {
    const HAL_Serial *iHAL;
    const T_Serial_RX62N_Info *iInfo;
    HAL_Serial_Callback_Transmit_Empty iTransmitEmptyFunc;
    HAL_Serial_Callback_Received_Byte iReceivedByteFunc;
    void *iCallbackWorkspace;
    T_Serial_Settings iSettings;
} T_Serial_RX62N_Workspace;

/*---------------------------------------------------------------------------*
 * Function Prototypes:
 *---------------------------------------------------------------------------*/

IRQ_ROUTINE(Serial_SCI0_RX);
IRQ_ROUTINE(Serial_SCI0_TX);

IRQ_ROUTINE(Serial_SCI1_RX);
IRQ_ROUTINE(Serial_SCI1_TX);

IRQ_ROUTINE(Serial_SCI2_RX);
IRQ_ROUTINE(Serial_SCI2_TX);

IRQ_ROUTINE(Serial_SCI3_RX);
IRQ_ROUTINE(Serial_SCI3_TX);

IRQ_ROUTINE(Serial_SCI5_RX);
IRQ_ROUTINE(Serial_SCI5_TX);

IRQ_ROUTINE(Serial_SCI6_RX);
IRQ_ROUTINE(Serial_SCI6_TX);

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/

T_Serial_RX62N_Workspace *G_Serial0Workspace=0;
extern const HAL_Serial Serial_RX62N_SCI0_Interface;
extern const T_Serial_RX62N_Info G_RX62N_Serial_SCI0_Info;

T_Serial_RX62N_Workspace *G_Serial1Workspace=0;
extern const HAL_Serial Serial_RX62N_SCI1_Interface;
extern const T_Serial_RX62N_Info G_RX62N_Serial_SCI1_Info;

T_Serial_RX62N_Workspace *G_Serial2Workspace=0;
extern const HAL_Serial Serial_RX62N_SCI2_Interface;
extern const T_Serial_RX62N_Info G_RX62N_Serial_SCI2_Info;

T_Serial_RX62N_Workspace *G_Serial3Workspace=0;
extern const HAL_Serial Serial_RX62N_SCI3_Interface;
extern const T_Serial_RX62N_Info G_RX62N_Serial_SCI3_Info;

T_Serial_RX62N_Workspace *G_Serial5Workspace=0;
extern const HAL_Serial Serial_RX62N_SCI5_Interface;
extern const T_Serial_RX62N_Info G_RX62N_Serial_SCI5_Info;

T_Serial_RX62N_Workspace *G_Serial6Workspace=0;
extern const HAL_Serial Serial_RX62N_SCI6_Interface;
extern const T_Serial_RX62N_Info G_RX62N_Serial_SCI6_Info;


/*---------------------------------------------------------------------------*
 * Routine:  RX62N_Serial_ProcessInterrupt_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Generic routine for handling any of the serial ports receive
 *      interrupts.
 *      NOTE:  This routine is ALWAYS processed inside of a interrupt
 *              service routine.
 * Inputs:
 *      T_SCI_PortEntry *p      -- Port's definition to process interrupt
 *---------------------------------------------------------------------------*/
static void RX62N_Serial_ProcessInterrupt_RX(T_Serial_RX62N_Workspace *p)
{
    // We have received 1 or more bytes.  Please do
    // something with this received byte
    p->iReceivedByteFunc(
        p->iCallbackWorkspace,
        p->iInfo->iSCIRegs->RDR);
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_Serial_ProcessInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Generic routine for handling any of the serial ports transmit
 *      interrupts.
 *      NOTE:  This routine is ALWAYS processed inside of a interrupt
 *              service routine.
 * Inputs:
 *      T_SCI_PortEntry *p      -- Port's definition to process interrupt
 *---------------------------------------------------------------------------*/
static void RX62N_Serial_ProcessInterrupt_TX(T_Serial_RX62N_Workspace *p)
{
    // Just ran out of bytes, please transmit more (1 byte for now)
    // (or we stop here)
    p->iTransmitEmptyFunc(p->iCallbackWorkspace, 1);
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI0_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial0 interrupt and forward to RX62N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI0_RX)
{
    IRQ_START();
    RX62N_Serial_ProcessInterrupt_RX(G_Serial0Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI0_TX)
{
    IRQ_START();
    RX62N_Serial_ProcessInterrupt_TX(G_Serial0Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI1_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial1 interrupt and forward to RX62N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI1_RX)
{
    IRQ_START();
    RX62N_Serial_ProcessInterrupt_RX(G_Serial1Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI1_TX)
{
    IRQ_START();
    RX62N_Serial_ProcessInterrupt_TX(G_Serial1Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI2_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial2 interrupt and forward to RX62N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI2_RX)
{
    IRQ_START();
    RX62N_Serial_ProcessInterrupt_RX(G_Serial2Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI2_TX)
{
    IRQ_START();
    RX62N_Serial_ProcessInterrupt_TX(G_Serial2Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI3_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial3 interrupt and forward to RX62N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI3_RX)
{
    IRQ_START();
    RX62N_Serial_ProcessInterrupt_RX(G_Serial3Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI3_TX)
{
    IRQ_START();
    RX62N_Serial_ProcessInterrupt_TX(G_Serial3Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI5_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial5 interrupt and forward to RX62N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI5_RX)
{
    IRQ_START();
    RX62N_Serial_ProcessInterrupt_RX(G_Serial5Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI5_TX)
{
    IRQ_START();
    RX62N_Serial_ProcessInterrupt_TX(G_Serial5Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  Serial_SCI6_RX
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the Serial6 interrupt and forward to RX62N_Serial_ProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Serial_SCI6_RX)
{
    IRQ_START();
    RX62N_Serial_ProcessInterrupt_RX(G_Serial6Workspace);
    IRQ_END();
}
IRQ_ROUTINE(Serial_SCI6_TX)
{
    IRQ_START();
    RX62N_Serial_ProcessInterrupt_TX(G_Serial6Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  SCI_SendChar
 *---------------------------------------------------------------------------*
 * Description:
 *      Send a single character out the given SCI_ port.
 *      NOTE:  Does not block even if output queue is full!
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to use
 *      TUInt8 c                  -- Character to send
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_Serial_OutputByte(void *aWorkspace, TUInt8 aByte)
{
    T_Serial_RX62N_Workspace *p = (T_Serial_RX62N_Workspace *)aWorkspace;

    p->iInfo->iSCIRegs->TDR = aByte;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  SCI_Disable
 *---------------------------------------------------------------------------*
 * Description:
 *      Disable SCI_ processing on this port.
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to disable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_Serial_Deactivate(void *aWorkspace)
{
    T_Serial_RX62N_Workspace *p = (T_Serial_RX62N_Workspace *)aWorkspace;
    const T_Serial_RX62N_Info *p_info = p->iInfo;

    //p_info->iSCIRegs->SCR.BIT.TIE = 0;
    //p_info->iSCIRegs->SCR.BIT.RIE = 0;
    InterruptDisable(p_info->iInterruptChannel_RX);
    InterruptDisable(p_info->iInterruptChannel_TX);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  SCI_Enable
 *---------------------------------------------------------------------------*
 * Description:
 *      Enable SCI_ processing on this port.
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_Serial_Activate(void *aWorkspace)
{
    T_Serial_RX62N_Workspace *p = (T_Serial_RX62N_Workspace *)aWorkspace;
    const T_Serial_RX62N_Info *p_info = p->iInfo;

    InterruptEnable(p_info->iInterruptChannel_RX);
    InterruptEnable(p_info->iInterruptChannel_TX);
    //p_info->iSCIRegs->SCR.BIT.TIE = 1;
    //p_info->iSCIRegs->SCR.BIT.RIE = 1;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_Serial_InitializeWorkspace_SCI0
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial0
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_Serial_InitializeWorkspace_SCI0(void *aWorkspace)
{
    T_Serial_RX62N_Workspace *p = (T_Serial_RX62N_Workspace *)aWorkspace;

