FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_Serial.c
    G_Serial0Workspace = p;
    p->iInfo = &G_RX62N_Serial_SCI0_Info;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_Serial_InitializeWorkspace_SCI1
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial1
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_Serial_InitializeWorkspace_SCI1(void *aWorkspace)
{
    T_Serial_RX62N_Workspace *p = (T_Serial_RX62N_Workspace *)aWorkspace;

    G_Serial1Workspace = p;
    p->iInfo = &G_RX62N_Serial_SCI1_Info;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_Serial_InitializeWorkspace_SCI2
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial2
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_Serial_InitializeWorkspace_SCI2(void *aWorkspace)
{
    T_Serial_RX62N_Workspace *p = (T_Serial_RX62N_Workspace *)aWorkspace;

    G_Serial2Workspace = p;
    p->iInfo = &G_RX62N_Serial_SCI2_Info;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_Serial_InitializeWorkspace_SCI3
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial3
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_Serial_InitializeWorkspace_SCI3(void *aWorkspace)
{
    T_Serial_RX62N_Workspace *p = (T_Serial_RX62N_Workspace *)aWorkspace;

    G_Serial3Workspace = p;
    p->iInfo = &G_RX62N_Serial_SCI3_Info;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_Serial_InitializeWorkspace_SCI5
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial5
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_Serial_InitializeWorkspace_SCI5(void *aWorkspace)
{
    T_Serial_RX62N_Workspace *p = (T_Serial_RX62N_Workspace *)aWorkspace;

    G_Serial5Workspace = p;
    p->iInfo = &G_RX62N_Serial_SCI5_Info;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_Serial_InitializeWorkspace_SCI6
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize a SCI_ port workspace for Serial6
 * Inputs:
 *      T_SCI_Port aPort        -- SCI_ port to enable
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_Serial_InitializeWorkspace_SCI6(void *aWorkspace)
{
    T_Serial_RX62N_Workspace *p = (T_Serial_RX62N_Workspace *)aWorkspace;

    G_Serial6Workspace = p;
    p->iInfo = &G_RX62N_Serial_SCI6_Info;
    p->iCallbackWorkspace = 0;
    p->iReceivedByteFunc = 0;
    p->iTransmitEmptyFunc = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_Serial_Configure
 *---------------------------------------------------------------------------*
 * Description:
 *      Link the SCI_ port to a pair of callback routines and an
 *      associated callback workspace.  The callbacks are called when
 *      a byte is received and when the transmit buffer becomes empty.
 * Inputs:
 *      void *aWorkspace          -- SCI_ port workspace
 *      void *aCallbackWorkspace  -- Callback's workspace
 *      HAL_Serial_Callback_Received_Byte aReceivedByteCallback
 *                                -- Callback routine for received bytes
 *      HAL_Serial_Callback_Transmit_Empty aTransmitEmptyCallback
 *                                -- Callback routine for transmit empty
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_Serial_Configure(
    void *aWorkspace,
    void *aCallbackWorkspace,
    HAL_Serial_Callback_Received_Byte aReceivedByteCallback,
    HAL_Serial_Callback_Transmit_Empty aTransmitEmptyCallback)
{
    T_Serial_RX62N_Workspace *p = (T_Serial_RX62N_Workspace *)aWorkspace;
    const T_Serial_RX62N_Info *p_info = p->iInfo;
    TUInt32 divider;
    TUInt32 n;
    TUInt8 cks;

    // Ensure interrupts for this channel is off
    InterruptDisable(p->iInfo->iInterruptChannel_RX);
    InterruptDisable(p->iInfo->iInterruptChannel_TX);

    // Ensure MSTP is on for this component (by making 0)
    SYSTEM.MSTPCRB.LONG &= ~(1UL << p->iInfo->iMSTPBit);

    p->iReceivedByteFunc = aReceivedByteCallback;
    p->iTransmitEmptyFunc = aTransmitEmptyCallback;
    p->iCallbackWorkspace = aCallbackWorkspace;

