FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_Serial.c
    // Serial Control Register (SCR)
    // Clear all the SCR settings (and turn off interrupts)
    // and stop all processing.
    p_info->iSCIRegs->SCR.BYTE = 0x00;

    // Serial Mode Register (SMR)
    //  0--- ----   CM =
    //                  0: Asynchronous mode
    //                  1: Clock synchronous mode
    //  -x-- ----   CHR =
    //                  0: 8 bits data length
    //                  1: 7 bits data length
    //  --x- ----   PE =
    //                  0:  Parity bit addition is not performed /
    //                      Parity bit checking is not performed
    //                  1:  Parity bit addition is performed /
    //                      Parity bit checking is performed
    //  ---x ----   PM = Parity mode
    //                  0: Selects even parity
    //                  1: Selects odd parity
    //  ---- x---   STOP = Stop bit length
    //                  0: 1 stop bit
    //                  1: 2 stop bits
    //  ---- -0--   MP = Multi-processor mode
    //                  0: Multi-processor communications function is disabled
    //                  1: Multi-processor communications function is enabled
    //  ---- --xx   CKS[0:1] =
    //                  00: PCLK clock / 1 (n=0)
    //                  01: PCLK clock / 2 (n=1)
    //                  10: PCLK clock / 4 (n=2)
    //                  11: PCLK clock / 8 (n=3)
    //
    // Determine the baud rate and PCLK divider CKS
    divider = BAUD_DIVIDER(SERIAL_PORTS_DEFAULT_BAUD);
    cks = 0;
    while (divider >= 256) {
        divider /= 4;
        cks++;
    }

    // Use a default group of settings
    p_info->iSCIRegs->SMR.BYTE =
    // Serial is asynchronous for this driver
        (0 << 7) |
        // Set the word length to 8 bits
            (0 << 6) |
        // No parity
            (0 << 5) |
        // Partiy (does not matter)
            (0 << 4) |
        // 1 stop bit
            (0 << 3) |
        // Not multi-processor mode
            (0 << 2) |
        // PCK divider
            (cks & 0x03);
    p_info->iSCIRegs->BRR = divider;

    /* Wait for at least 1 bit time */
    for (n = 0; n < 1000000; n++)
        ; // TBD: This is not very good

    // Set up the SCR to turn on Tx and Rx interrupts
    p_info->iSCIRegs->SCR.BIT.TIE = 1;
    p_info->iSCIRegs->SCR.BIT.RIE = 1;

    InterruptRegister(p_info->iInterruptChannel_RX, p_info->iISR_RX,
        p_info->iPriority, p->iHAL->iInterface.iName);
    InterruptRegister(p_info->iInterruptChannel_TX, p_info->iISR_TX,
        p_info->iPriority, p->iHAL->iInterface.iName);

    // Enable sending/receive data (must be both done at the same time)
    p_info->iSCIRegs->SCR.BYTE |= 0x30;

    IEN(SCI0, RXI0) = 1;
    IEN(SCI0, TXI0) = 1;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_Serial_SetSettings
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure the SCI_ port settings
 * Inputs:
 *      void *aWorkspace          -- SCI_ port workspace
 *      T_SCI_Settings *aSettings -- Settings to use for SCI_ port
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_Serial_SetSettings(
    void *aWorkspace,
    T_Serial_Settings *aSettings)
{
    T_Serial_RX62N_Workspace *p = (T_Serial_RX62N_Workspace *)aWorkspace;
    const T_Serial_RX62N_Info *p_info = p->iInfo;
    TUInt32 divider;
    TUInt32 n;
    TUInt8 cks;

    // Record these settings
    p->iSettings = *aSettings;

    // Clear all the SCR settings (and turn off interrupts)
    // and stop all processing.
    p_info->iSCIRegs->SCR.BYTE = 0x00;

    // Serial Mode Register (SMR)
    //  0--- ----   CM =
    //                  0: Asynchronous mode
    //                  1: Clock synchronous mode
    //  -x-- ----   CHR =
    //                  0: 8 bits data length
    //                  1: 7 bits data length
    //  --x- ----   PE =
    //                  0:  Parity bit addition is not performed /
    //                      Parity bit checking is not performed
    //                  1:  Parity bit addition is performed /
    //                      Parity bit checking is performed
    //  ---x ----   PM = Parity mode
    //                  0: Selects even parity
    //                  1: Selects odd parity
    //  ---- x---   STOP = Stop bit length
    //                  0: 1 stop bit
    //                  1: 2 stop bits
    //  ---- -0--   MP = Multi-processor mode
    //                  0: Multi-processor communications function is disabled
    //                  1: Multi-processor communications function is enabled
    //  ---- --xx   CKS[0:1] =
    //                  00: PCLK clock / 1 (n=0)
    //                  01: PCLK clock / 2 (n=1)
    //                  10: PCLK clock / 4 (n=2)
    //                  11: PCLK clock / 8 (n=3)
    //
    // Determine the baud rate and PCLK divider CKS
    divider = BAUD_DIVIDER(aSettings->iBaud);
    cks = 0;
    while (divider >= 256) {
        divider /= 4;
        cks++;
    }
    p_info->iSCIRegs->SMR.BYTE =
    // Serial is asynchronous for this driver
        (0 << 7) |
        // Set the word length (7 or 8 bits)
            ((aSettings->iWordLength == 7) ? (1 << 6) : (0 << 6)) |
        // Enable parity checking if not none
            ((aSettings->iParity != SERIAL_PARITY_NONE) ? (1 << 5) : (0 << 5)) |
        // Even or odd parity only
            ((aSettings->iParity == SERIAL_PARITY_EVEN) ? (1 << 4) : (0 << 4)) |
        // 1 or 2 stop bits?
            ((aSettings->iStopBit == SERIAL_STOP_BITS_2) ? (1 << 3) : (0 << 3))
            |
            // Not multi-processor mode
            (0 << 2) |
        // PCK divider
            (cks & 0x03);
    p_info->iSCIRegs->BRR = divider;

    /* Wait for at least 1 bit time */
    for (n = 0; n < 1000000; n++)
        ; // TBD: This is not very good

    // Set up the SCR to turn on Tx and Rx interrupts
    p_info->iSCIRegs->SCR.BIT.TIE = 1;
    p_info->iSCIRegs->SCR.BIT.RIE = 1;

