FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_Serial.c
    // Enable sending/receive data
    p_info->iSCIRegs->SCR.BIT.TE = 1;
    p_info->iSCIRegs->SCR.BIT.RE = 1;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_Serial_GetSettings
 *---------------------------------------------------------------------------*
 * Description:
 *      Return the previously configured SCI_ port
 * Inputs:
 *      void *aWorkspace          -- SCI_ port workspace
 *      T_SCI_Settings *aSettings -- Settings used for SCI_ port
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_Serial_GetSettings(
    void *aWorkspace,
    T_Serial_Settings *aSettings)
{
    T_Serial_RX62N_Workspace *p = (T_Serial_RX62N_Workspace *)aWorkspace;

    // Record these settings
    *aSettings = p->iSettings;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_Serial_SetHandshakingControl
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the handshaking control for this SCI_ port (if it has it)
 * Inputs:
 *      void *aWorkspace          -- SCI_ port workspace
 *      T_SCI_HandshakingControl -- Control bits to use
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_Serial_SetHandshakingControl(
    void *aWorkspace,
    T_serialHandshakingControl aControl)
{
    PARAM_NOT_USED(aWorkspace); PARAM_NOT_USED(aControl);

    return UEZ_ERROR_NOT_SUPPORTED;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_Serial_GetHandshakingStatus
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the handshaking control for this SCI_ port (if it has it)
 * Inputs:
 *      void *aWorkspace          -- SCI_ port workspace
 *      T_SCI_HandshakingStatus *aStatus -- Current status
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX62N_Serial_GetHandshakingStatus(
    void *aWorkspace,
    T_serialHandshakingStatus *aStatus)
{
    PARAM_NOT_USED(aWorkspace); PARAM_NOT_USED(aStatus);

    return UEZ_ERROR_NOT_SUPPORTED;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX62N_Serial_GetStatus
 *---------------------------------------------------------------------------*
 * Description:
 *      Return the status of the port
 * Inputs:
 *      void *aWorkspace          -- SCI_ port workspace
 * Outputs:
 *      T_SCI_StatusByte          -- Status byte returned
 *---------------------------------------------------------------------------*/
T_serialStatusByte RX62N_Serial_GetStatus(void *aWorkspace)
{
    T_serialStatusByte status = 0;
    T_Serial_RX62N_Workspace *p = (T_Serial_RX62N_Workspace *)aWorkspace;

    // Only empty if both TEMT and THRE are empty
    if (p->iInfo->iSCIRegs->SSR.BYTE & 0x80) {
        status |= SERIAL_STATUS_TRANSMIT_EMPTY;
    } else {
        // not empty
    }

    return status;
}

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
// List of SCI_ port HAL interfaces
const HAL_Serial Serial_RX62N_SCI0_Interface = {
    "RX62N:SCI0",
    0x0100,
    RX62N_Serial_InitializeWorkspace_SCI0,
    sizeof(T_Serial_RX62N_Workspace),

    RX62N_Serial_Configure,
    RX62N_Serial_SetSettings,
    RX62N_Serial_GetSettings,
    RX62N_Serial_Activate,
    RX62N_Serial_Deactivate,
    RX62N_Serial_OutputByte,
    0,
    0,
    RX62N_Serial_GetStatus,
};

const HAL_Serial Serial_RX62N_SCI1_Interface = {
    "RX62N:SCI1",
    0x0100,
    RX62N_Serial_InitializeWorkspace_SCI1,
    sizeof(T_Serial_RX62N_Workspace),

    RX62N_Serial_Configure,
    RX62N_Serial_SetSettings,
    RX62N_Serial_GetSettings,
    RX62N_Serial_Activate,
    RX62N_Serial_Deactivate,
    RX62N_Serial_OutputByte,
    0,
    0,
    RX62N_Serial_GetStatus,
};

const HAL_Serial Serial_RX62N_SCI2_Interface = {
    "RX62N:SCI2",
    0x0100,
    RX62N_Serial_InitializeWorkspace_SCI2,
    sizeof(T_Serial_RX62N_Workspace),

    RX62N_Serial_Configure,
    RX62N_Serial_SetSettings,
    RX62N_Serial_GetSettings,
    RX62N_Serial_Activate,
    RX62N_Serial_Deactivate,
    RX62N_Serial_OutputByte,
    0,
    0,
    RX62N_Serial_GetStatus,
};

const HAL_Serial Serial_RX62N_SCI3_Interface = {
    "RX62N:SCI3",
    0x0100,
    RX62N_Serial_InitializeWorkspace_SCI3,
    sizeof(T_Serial_RX62N_Workspace),

    RX62N_Serial_Configure,
    RX62N_Serial_SetSettings,
    RX62N_Serial_GetSettings,
    RX62N_Serial_Activate,
    RX62N_Serial_Deactivate,
    RX62N_Serial_OutputByte,
    0,
    0,
    RX62N_Serial_GetStatus,
};

const HAL_Serial Serial_RX62N_SCI5_Interface = {
    "RX62N:SCI5",
    0x0100,
    RX62N_Serial_InitializeWorkspace_SCI5,
    sizeof(T_Serial_RX62N_Workspace),

    RX62N_Serial_Configure,
    RX62N_Serial_SetSettings,
    RX62N_Serial_GetSettings,
    RX62N_Serial_Activate,
    RX62N_Serial_Deactivate,
    RX62N_Serial_OutputByte,
    0,
    0,
    RX62N_Serial_GetStatus,
};

const HAL_Serial Serial_RX62N_SCI6_Interface = {
    "RX62N:SCI6",
    0x0100,
    RX62N_Serial_InitializeWorkspace_SCI6,
    sizeof(T_Serial_RX62N_Workspace),

    RX62N_Serial_Configure,
    RX62N_Serial_SetSettings,
    RX62N_Serial_GetSettings,
    RX62N_Serial_Activate,
    RX62N_Serial_Deactivate,
    RX62N_Serial_OutputByte,
    0,
    0,
    RX62N_Serial_GetStatus,
};

const T_Serial_RX62N_Info G_RX62N_Serial_SCI0_Info = {
    VECT_SCI0_RXI0,
    VECT_SCI0_TXI0,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX62N_SCI *)&SCI0,
    (TISRFPtr)Serial_SCI0_RX,
    (TISRFPtr)Serial_SCI0_TX,
    31, // MSTPB31
    0, // None
};

const T_Serial_RX62N_Info G_RX62N_Serial_SCI1_Info = {
    VECT_SCI1_RXI1,
    VECT_SCI1_TXI1,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX62N_SCI *)&SCI1,
    (TISRFPtr)Serial_SCI1_RX,
    (TISRFPtr)Serial_SCI1_TX,
    30, // MSTPB30
    (1<<1), // Bit 1
};

const T_Serial_RX62N_Info G_RX62N_Serial_SCI2_Info = {
    VECT_SCI2_RXI2,
    VECT_SCI2_TXI2,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX62N_SCI *)&SCI2,
    (TISRFPtr)Serial_SCI2_RX,
    (TISRFPtr)Serial_SCI2_TX,
    29, // MSTPB29
    (1<<2), // Bit 2
};

