FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX62N/RX62N_Serial.c
const T_Serial_RX62N_Info G_RX62N_Serial_SCI3_Info = {
    VECT_SCI3_RXI3,
    VECT_SCI3_TXI3,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX62N_SCI *)&SCI3,
    (TISRFPtr)Serial_SCI3_RX,
    (TISRFPtr)Serial_SCI3_TX,
    28, // MSTPB28
    (1<<3), // Bit 3
};

const T_Serial_RX62N_Info G_RX62N_Serial_SCI5_Info = {
    VECT_SCI5_RXI5,
    VECT_SCI5_TXI5,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX62N_SCI *)&SCI5,
    (TISRFPtr)Serial_SCI5_RX,
    (TISRFPtr)Serial_SCI5_TX,
    26, // MSTPB26
    0, // None
};

const T_Serial_RX62N_Info G_RX62N_Serial_SCI6_Info = {
    VECT_SCI6_RXI6,
    VECT_SCI6_TXI6,
    INTERRUPT_PRIORITY_HIGH,
    (T_RX62N_SCI *)&SCI6,
    (TISRFPtr)Serial_SCI6_RX,
    (TISRFPtr)Serial_SCI6_TX,
    25, // MSTPB25
    (1<<6), // Bit 6
};

void RX62N_SCI0_Require(void)
{
	static const T_uezGPIOPortPin pins[] = {
           	GPIO_P21,  	// RXD0
			GPIO_P20	// TXD0
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI0", (T_halInterface *)&Serial_RX62N_SCI0_Interface, 0, 0);
	RX62N_PinsLock(pins, ARRAY_COUNT(pins));
	
	PORT2.ICR.BIT.B1 = 1; 			// Turn on P21 (RXD0) input buffer
}

void RX62N_SCI1_A_Require(void)
{
    static const T_uezGPIOPortPin pins[] = {
           	GPIO_P30,  	// RXD1-A
			GPIO_P26	// TXD1-A
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI1", (T_halInterface *)&Serial_RX62N_SCI1_Interface, 0, 0);
	RX62N_PinsLock(pins, ARRAY_COUNT(pins));
	
	IOPORT.PFFSCI.BIT.SCI1S = 0;	// Select SCI1-A pins
	PORT3.ICR.BIT.B0 = 1; 			// Turn on P30 (RXD1-A) input buffer
}

void RX62N_SCI1_B_Require(void)
{
    static const T_uezGPIOPortPin pins[] = {
           	GPIO_PF2,  	// RXD1-B
			GPIO_PF0	// TXD1-B
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI1", (T_halInterface *)&Serial_RX62N_SCI1_Interface, 0, 0);
	RX62N_PinsLock(pins, ARRAY_COUNT(pins));
	
	IOPORT.PFFSCI.BIT.SCI1S = 1;	// Select SCI1-B pins
	PORTF.ICR.BIT.B2 = 1; 			// Turn on PF2 (RXD1-B) input buffer 
}

void RX62N_SCI2_A_Require(void)
{
    static const T_uezGPIOPortPin pins[] = {
           	GPIO_P12,  	// RXD2-A
			GPIO_P13	// TXD2-A
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI2", (T_halInterface *)&Serial_RX62N_SCI2_Interface, 0, 0);
	RX62N_PinsLock(pins, ARRAY_COUNT(pins));
	
	IOPORT.PFFSCI.BIT.SCI2S = 0;	// Select SCI2-A pins
	PORT1.ICR.BIT.B2 = 1; 			// Turn on P12 (RXD2-A) input buffer 
}

void RX62N_SCI2_B_Require(void)
{
    static const T_uezGPIOPortPin pins[] = {
           	GPIO_P52,  	// RXD2-B
			GPIO_P50	// TXD2-B
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI2", (T_halInterface *)&Serial_RX62N_SCI2_Interface, 0, 0);
	RX62N_PinsLock(pins, ARRAY_COUNT(pins));
	
	IOPORT.PFFSCI.BIT.SCI2S = 1;	// Select SCI2-B pins
	PORT5.ICR.BIT.B2 = 1; 			// Turn on P52 (RXD2-B) input buffer 
}

void RX62N_SCI3_A_Require(void)
{
    static const T_uezGPIOPortPin pins[] = {
           	GPIO_P16,  	// RXD3-A
			GPIO_P17	// TXD3-A
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI3", (T_halInterface *)&Serial_RX62N_SCI3_Interface, 0, 0);
	RX62N_PinsLock(pins, ARRAY_COUNT(pins));
	
	IOPORT.PFFSCI.BIT.SCI3S = 0;	// Select SCI3-A pins
	PORT1.ICR.BIT.B6 = 1; 			// Turn on P16 (RXD3-A) input buffer 
}

void RX62N_SCI3_B_Require(void)
{
    static const T_uezGPIOPortPin pins[] = {
           	GPIO_P25,  	// RXD3-B
			GPIO_P23	// TXD3-B
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI3", (T_halInterface *)&Serial_RX62N_SCI3_Interface, 0, 0);
	RX62N_PinsLock(pins, ARRAY_COUNT(pins));
	
	IOPORT.PFFSCI.BIT.SCI3S = 1;	// Select SCI3-B pins
	PORT2.ICR.BIT.B5 = 1; 			// Turn on P25 (RXD3-B) input buffer 
}

void RX62N_SCI5_Require(void)
{
	static const T_uezGPIOPortPin pins[] = {
           	GPIO_PC2,  	// RXD0
			GPIO_PC3	// TXD0
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI5", (T_halInterface *)&Serial_RX62N_SCI5_Interface, 0, 0);
	RX62N_PinsLock(pins, ARRAY_COUNT(pins));
	
	PORTC.ICR.BIT.B2 = 1;	// Turn on PC2 (RXD5) input buffer 
}

void RX62N_SCI6_A_Require(void)
{
    static const T_uezGPIOPortPin pins[] = {
           	GPIO_P01,  	// RXD6-A
			GPIO_P00	// TXD6-A
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI6", (T_halInterface *)&Serial_RX62N_SCI6_Interface, 0, 0);
	RX62N_PinsLock(pins, ARRAY_COUNT(pins));
	
	IOPORT.PFFSCI.BIT.SCI6S = 0;	// Select SCI6-A pins
	PORT0.ICR.BIT.B1 = 1; 			// Turn on P01 (RXD6-B) input buffer 
}

void RX62N_SCI6_B_Require(void)
{
    static const T_uezGPIOPortPin pins[] = {
           	GPIO_P33,  	// RXD6-B
			GPIO_P32	// TXD6-B
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("SCI6", (T_halInterface *)&Serial_RX62N_SCI6_Interface, 0, 0);
	RX62N_PinsLock(pins, ARRAY_COUNT(pins));
	
	IOPORT.PFFSCI.BIT.SCI6S = 1;	// Select SCI6-B pins
	PORT3.ICR.BIT.B3 = 1; 			// Turn on P33 (RXD6-B) input buffer 
}


/*-------------------------------------------------------------------------*
 * End of File:  RX62N_Serial.c
 *-------------------------------------------------------------------------*/
